sage: crt([0,1,2,4,5],[2,3,5,7,11])
2062
sage: 2062 % 2
0
sage: 2062 % 3
1
sage: 2062 % 5
2
sage: 2062 % 7
4
sage: 2062 % 11
5
