sage: R = PolynomialRing(QQ,'x')
sage: f=R.lagrange_polynomial([(1,8),(2,-1),(3,2),(4,4),(5,12)])
sage: f
5/6*x^4 - 21/2*x^3 + 289/6*x^2 - 185/2*x + 62
sage: f(1)
8
sage: f(2)
-1
sage: f(3)
2
sage: f(4)
4
sage: f(5)
12
